{
  "profile": {
    "name": "Saikiran Somanagoudar",
    "description": "A software engineer with over 4 years crafting scalable web experiences. I build applications from frontend to cloud. Dive into my journey where clean code meets creative problem solving!",
    "linkedin": "https://www.linkedin.com/in/saikiransomanagoudar/",
    "github": "https://github.com/saikiransomanagoudar",
    "devpost": "https://devpost.com/saikiransomanagoudar"
  },
  "education": [
    {
      "schoolName": "Jawahar Navodaya Vidyalaya",
      "major": "High School",
      "dates": "2008-2015",
      "logo": "/navodaya.png"
    },
    {
      "schoolName": "Reva University",
      "major": "Bachelor of Technology (BTech) in Computer Science and Engineering",
      "dates": "2015-2019",
      "logo": "/reva.png"
    },
    {
      "schoolName": "Illinois Institute of Technology",
      "major": "Master's in Computer Science",
      "dates": "2023-2025",
      "logo": "/iltech.png"
    }
  ],
  "experience": [
    {
      "title": "Software Engineer",
      "company": "CrowdDoing",
      "location": "Chicago, IL",
      "dates": "October 2025 - Present",
      "responsibilities": [
        "Developed new interactive UI components and features for the AIME/Imagination Project web application using React, creating reusable component libraries that improved team workflow efficiency by 30%",
        "Built responsive data visualization dashboards integrating Django backend APIs, implementing efficient state management and data fetching that reduced rendering time by 40% and enhanced user experience",
        "Enhanced application performance by 25% through frontend optimization techniques including code splitting, lazy loading, and component rendering improvements while implementing automated testing pipelines and Docker-based CI/CD processes to ensure consistent quality standards"
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "Wipro Technologies",
      "location": "Bengaluru, India",
      "dates": "September 2019 - June 2023",
      "responsibilities": [
        "Spearheaded the migration of 30+ client-facing applications to AWS hybrid cloud, optimizing responsive design and frontend performance to reduce downtime by 25% and enhance user experience across multiple platforms",
        "Built and deployed interactive single-page application components using React with advanced state management and asynchronous process handling, reducing page load times by 15% and improving overall application performance",
        "Integrated AI-powered AWS CodeGuru to automate CI/CD workflows and code review processes for multiple web applications, reducing manual intervention by 50% and improving deployment reliability",
        "Engineered UI/UX enhancements for enterprise React web applications with server-side rendering implementation, optimizing component rendering efficiency, increasing average user session duration by 20% while reducing bounce rates",
        "Collaborated with product stakeholders following agile methodologies to gather requirements and translate them into technical specifications, conducting comprehensive unit and integration tests while participating in code reviews to maintain quality standards"
      ]
    }
  ],
  "projects": [
    {
      "name": "GIF Enigma",
      "description": "GIF Enigma is a word/phrase-guessing game built for Reddit community where players interpret GIFs to uncover a hidden word or phrase. A fun and engaging challenge that tests your ability to think visually and make connections.",
      "code": "iYpGLeuMv-w",
      "techStack": [
        "React",
        "Devvit",
        "TypeScript",
        "Tailwind CSS",
        "Gemini 2.5 Flash Lite",
        "Giphy API"
      ],
      "link": "https://www.reddit.com/r/PlayGIFEnigma/",
      "github": "https://github.com/saikiransomanagoudar/gif-enigma"
    },
    {
      "name": "Pantry Tracker",
      "description": "Pantry Tracker is an inventory management application that helps users to keep track of their pantry items. Users can add, update, delete, and search for items in their pantry. The app includes user authentication features, allowing multiple users to securely track and manage their pantry inventory.",
      "code": "srAL2mlq1Fo",
      "techStack": [
        "Next.js",
        "JavaScript",
        "Tailwind CSS",
        "Node.js",
        "Firebase",
        "Firestore"
      ],
      "link": "https://pantry-tracker-saikiran.vercel.app/",
      "github": "https://github.com/saikiransomanagoudar/pantry-tracker"
    }
    
  ],
  "skills": {
    "languages": [
      ["JavaScript", "100%"],
      ["TypeScript", "90%"],
      ["Python", "95%"],
      ["Java", "90%"],
      ["HTML", "100%"],
      ["CSS", "100%"]
    ],
    "frontend": [
      ["React.js", "100%"],
      ["Next.js", "90%"],
      ["Redux", "90%"],
      ["Tailwind CSS", "100%"]
    ],
    "backend": [
      ["Node.js", "100%"],
      ["Django", "85%"],
      ["Flask", "85%"],
      ["FastAPI", "90%"],
      ["RESTful APIs", "100%"],
      ["GraphQL", "80%"]
    ],
    "databases": [
      ["PostgreSQL", "85%"],
      ["MySQL", "90%"],
      ["MongoDB", "100%"],
      ["Redis", "100%"]
    ],
    "cloud": [
      ["AWS", "82%"],
      ["Docker", "85%"],
      ["Jenkins", "85%"],
      ["Kubernetes", "80%"],
      ["Vercel", "100%"],
      ["Heroku", "100%"]
    ],
    "AI & Tools": [
      ["Git", "100%"],
      ["Jest", "85%"],
      ["LangChain", "90%"],
      ["NLTK", "85%"],
      ["Matplotlib", "85%"],
      ["NumPy", "95%"]
    ]
  }
}
